var local_database = [
    {
        date: "Sep 18 2016",
        title: "正是虾肥蟹壮时",
        imgSrc: "/images/post/crab.png",
        avatar: "/images/avatar/1.png",
        content: "菊黄蟹正肥，品尝秋之味。徐志摩把,“看初花的荻芦”和“到楼外楼吃蟹”,并列为秋天来杭州不能错过的风雅之事；用林妹妹的话讲是“螯封嫩玉双双满，",
        reading: "112",
        collection: "96",
        headImgSrc: "/images/post/crab.png",
        author: "林白衣",
        dateTime: "24小时前",
        detail: "秋风起，蟹脚痒；菊花开，闻蟹来”。秋风一起，菊黄蟹肥，持螯赏菊，那种意境想来就是一种国画的美。满地的菊花开了，花香浸润着飞翔的翅膀。湖里的螃蟹肥了，蟹黄黄了。中国人吃蟹的历史悠久，徐州翠屏山汉墓陪葬品里就有螃蟹壳。从《周礼》、《齐民要术》，到后来陆龟蒙的《蟹志》、傅肱的《蟹谱》、高似孙的《蟹略》，都介绍过螃蟹的烹制和吃的方法。魏晋时期，人们把吃蟹、饮酒、赏菊、赋诗作为一种风流韵事。唐宋以后，名人更钟情蟹文化，吟咏螃蟹的诗篇甚多。比如有唐代唐彦谦的《蟹》诗，皮日休的《咏蟹》，李白的《月下独酌》等。《红楼梦》中就有一个章回专写螃蟹宴的。吃螃蟹时，贾宝玉题《咏蟹》曰：“持螯更喜桂阴凉，泼醋擂姜兴欲狂。饕餮王孙应有酒，横行公子却无肠。脐间积冷馋忘忌，指上沾腥洗尚香。原为世人美口腹，坡仙曾笑一生忙。”黛玉提笔写：“铁甲长戈死未忘，堆盘色相喜先尝，螯封嫩玉双双满，壳凸红脂块块香。多肉更怜卿八足，助情谁劝我千觞？对斯佳品酬佳节，桂拂清风菊带霜。”小时候吃蟹，一般都是自己捉的。那时村旁的小河边，经常螃蟹横行。河水很清很浅，穿着短裤或挽起裤腿就可以下河摸。还有另外一种晚上捕蟹的方法，夜色降临后，拿一束火把或者打亮手电来照蟹，晚上的蟹会向着光亮的地方爬过来，只要发现了螃蟹，你尽管捉住往蟹篓里扔就可以了。在小麦将熟时，此时的河蟹被人称作“麦黄蟹”。而捕秋蟹是在菊花正黄时，这时的蟹叫“菊黄蟹”。蟹是人间美味。“四方之味，当许含黄伯为第一”。“含黄伯”即金秋时节的螃蟹。深秋，正是看菊吃蟹的好时节。俗话说：九月团脐，十月尖，九月的雌蟹，黄满丰腴，十月的雄蟹，黄白鲜肥。所以吃蟹不在于雌雄，而在于它成熟的季节。有次我们去日照一好友家，她就烧得一手好菜，很普通的海味她烧出来特鲜。我们去海边捉得螃蟹，用草绳串成一串一串的。好友拿了几串，蒸好后放在桌上，一大海盆，招呼我们几个吃。正如清朝美食家袁枚所说，蟹，不加佐料，便色、香、味俱全。此言得之。刚出蒸笼的蟹是最诱人的，色泽金黄透红，散着独有的腥香，白腹如玉，勾引着你。那次，是我吃的最鲜的一次螃蟹。秋风送爽菊花黄，正是品食河蟹的最佳季节。在一农家小院，月光泼洒桂花飘香，亲朋好友围聚一桌，亲手剥蟹背，公蟹蟹膏白如玉，母蟹蟹黄黄如金。蟹肉进嘴满口鲜香，放下蟹壳，拿起黄酒杯，爽爽地一口咽下，黄酒的馨香与蟹肉的鲜香浑然一体……边吃边聊，直至夕阳西斜，在微醺的醉意中，体会菊黄蟹肥的金秋时光。",
        postId: 0,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
            title: "夜夜夜夜-齐秦",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
        }
    },
    {
        title: "比利·林恩的中场故事",
        content: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。",
        imgSrc: "/images/post/bl.png",
        reading: 62,
        detail: "《比利·林恩的中场战事》是一个非常文艺片手法的心理剧，平行剪辑随林恩对现场的反应走，不知道下一场戏是什么，你也不知道下一场戏主人公在何方，而这就是李安所擅长的。所以说，与技术相对而言，观众看到的仍是以前那个热衷于细节的李安。每个插叙的画面都有细节做串联，电影里，中场演出进行时，这群面临过生死存亡的人走出舞台，烟雾喷出，士兵们被吓得惊慌失措。而画面也会切到战场上硝烟四起。还有林恩独自站在真命天女组合后面，前面是万众快乐，而身后是战场上生死离别的悲伤。英雄的归处只有战场。他们不再属于和平。电影里除了士兵们之外，所有人物几乎都在消解英雄这个词语。电影经纪人、球场管理者、到林恩的姐姐、再到拉拉队的女孩，他们眼中的林恩打从一开始就不是与自己在同一个世界的，所以在这个基础上产生的一切感情只能结束于现实世界。电影延续了李安一贯的善意与不安，最后还是悲情满满。真理或谎言，都无法概括这个世界，残酷与温暖并存，关怀与孤独同在。《比利·林恩的中场战事》原著小说是通过一个19岁男孩的眼睛看周遭的世界，描写他的想法和感受。在导演的120帧4K 3D的镜头里，感同身受得到了最大化地体现。导演用了不少人物的主观视角，在电影里两个大场面，球赛中场表演和伊拉克战场上，这种用120帧4K 3D拍成的主观镜头一下子让观众成为了比利·林恩。甚至有的观众认为诟病120帧因为过于清晰，呈现在大银幕上反而会造成不真实感。但事实，无论是锣鼓喧天的球赛中场还是枪林弹雨的伊拉克战场，虽然都是真实发生的现实，却又超出了日常生活景象，用来呈现比利·林恩的视角，简直是锦上添花。作为观者，120帧3D再清晰，也不是虚拟现实技术，它并没有颠覆人们的观影习惯，导演仍然要靠巧妙地运用镜头语言讲故事，用技术添彩，而不是通过这种技术强迫观众靠近人物，理解人物。在观影过程中，完全没有强迫被带入故事的感觉，看着看着，甚至都忘记了自己戴着眼镜，看的是3D电影，完全被故事吸引，体会着比利·林恩的困惑、挣扎和他压抑的情感。倒是电影结束后，片中好几个场景会始终盘踞脑海，久久不能忘。也许，120帧带来的，是过目不忘的体验。影片的技术革新影响的不仅仅是画面，导演显然认为在新的技术表现力下演员的表演方式也需要突破性的革命。最明显的演员经常直视摄影机表演，这在传统的电影理论中是一种突破第四面墙的大胆做法，使用的时候应该慎之又慎。有节制的使用，可以理解为镜头代表的是角色的第一视角，增强观众的代入感，但电影毕竟不是VR不是第一人称设计游戏，观众还是更习惯于躲在第四面墙之后的安全感，更何况影片的主视点还不是仅仅锁定在主角一人身上，各种路人都有可能成为摄影机的第一人称视点，视角各种转换反而让人很不习惯。当然，李安的拥趸还是以文艺青年电影迷为主，观众也不会要求他的电影有爆米花影片的视觉轰炸频率。但在故事上，该片确实太缺乏惊喜，试图用不断的闪回来讲述一个原本平庸缺乏亮点的故事。而且连李安导演最擅长的人物刻画这次也掉了链子，大部分台词呆板浅薄，尽管各位新老戏骨，也没有办法挽救平淡的影片内核。影片在剧情上颇有可取之处，但运用在影片上的技术却并不成功。这部影片展现出他对于镜头语言新可能性持之以恒的探索和追求，和《断背山》一样，这部影片是对于那些被疏远的美国人一次朴素的描述。不过《比利-林恩》和李安以往的作品一样缺乏靠谱的剧本，有着很好的主题，但却配上粗俗陈腐的对白和虚假的南方口音。影片在高帧率上的尝试更多是满足了技术上的好奇心，而不能说是一次成熟的创新。最后的那场战争戏里，比利回忆起他与敌人交火的细节，以近乎纪录片的风格捕捉了这场战斗里每一个血淋淋的细节。中场表演那场戏则可以拍成一部独立的短片，这场戏在天命真女装腔作势的表演和比利的局促不安之间形成了一个鲜明的对比。",
        collection: 92,
        dateTime: "24小时前",
        headImgSrc: "/images/post/bl.png",
        author: "迷的城",
        date: "Nov 20 2016",
        avatar: "/images/avatar/1.png",
        postId: 1,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38",
            title: "鬼迷心窍-李宗盛",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
        }
    },
    {
        //按住alt + shift + F 可以格式化代码样式
        title: "当我们在谈论经济学时，我们在谈论什么?",
        content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
        detail: "1.引言:在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里。2 ”简笔素描“与”油画肖像”：我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。2.1 ”简笔素描”：对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——就像我们在看素描画时，有时简化的风格便于我们辨认出画家所要强调的人物的主要特征。在这里引用一句话来说明本段的观点：“如果一个简化的假设引致模型对其正在强调的问题提供不正确的回答，那么，缺乏现实性可能是一种缺点。然而，如果简化并不会引致模型对其正在强调的问题提供不正确的答案，那么缺乏现实性则是一种优点。”2.2 补充那么什么样的经济学算得上”油画肖像“？很多，比如经济学的博士论文，国内外正规学术期刊上有数模有实证的这些学术文献，都算得上。但这并不意味着cutting edge的东西就一定是复杂的，因为论证过程的严密程度和结论的复杂程度不一定是正相关。所以：2.2.1 在验证严密的前提下，越是在极简假设下得出的极简结论，越具有价值，但也越容易被推翻和被质疑。（黑体字部分是阅读张五常《中国制度经济》有感）2.2.2 在验证严密的前提下，越是复杂的假设下得出的复杂结论，价值也越小，但也不容易被推翻。如果我们把所讨论的经济问题涉及的全部相关因素都纳入其中做考量，得出的结论将会100%符合我们的现实，但这样也相当于我们什么也没有说，这种结论缺乏意义。（也几乎是我们无法做到的）2.2.3 在以上两条的基础上，一个好的经济学科研工作者，应该在”简单“和”复杂“之间做出自己的权衡。3 经济学的作用边界在这里我只想作为一个普通的经济学爱好者，同时借Wittgenstein之口来澄清关于经济学的几个点：3.1 经济学不是一门自然科学。它不像自然科学一样，可以设置精准的实环境，发生条件，催化剂，投入物质，并依据结果控制相关变量。所有的经济研究都是基于现实的，基于过去，不完美信息下的，模拟下的设想。3.2 经济学的目的和意义在于对”经济“现实做出逻辑上的澄清。经济学不产生”经济学命题“，而是让现实中的命题得到澄清。如果没有经济学，关于某些现实可以说是模糊不清的：经济学的任务是使得现实中关人类生产和交换及其它活动中的规律具有逻辑上合理性和可论证性，并使这些规律及其论证具有分明的界限。3.3 经济学应该按照以下方式起到阐明的作用：任何一个”真正理解“经济学的这些学说的人，当他已经用这些命题当梯子登上高出之后，最终会认识到它们是无意义的。（比如说，他在登高之后必须抛掉梯子。）他必须超越这些命题，然后才会正确的看待这个世界。以上是我对经济学”有什么用“的解释就我自己学习经济学的体验而言，首先我是觉得经济学”没用“的，当我已经知道经济学”有什么用“，从而觉得经济学”没用“时，已经是在这个路上义无反顾的走了很久以后的事情了。",
        imgSrc: "/images/post/sls.jpg",
        headImgSrc: "/images/post/sls.jpg",
        reading: 62,
        collection: 92,
        author: "知乎",
        date: "Nov 12 2016",
        dateTime: "三天前",
        avatar: "/images/avatar/3.png",
        postId: 2,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
            title: "女儿情-万晓利",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
        }
    },
    {
        title: "微信·小程序开发工具安装指南",
        content: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序",
        imgSrc: "/images/post/xiaolong.jpg",
        reading: 102,
        detail: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。反正，这一栏里的购物和游戏我是从来没点进去过的。以腾讯的尿性，小程序同服务号一样，其关系链及重要功能的开放程度会因“人”而异。对，优质的接口只会开放给腾讯的儿子们（滴滴呀、京东呀）微信从来就是一眼不合就封杀，优步就是很好的案例。官方解释是优步涉嫌诱导，滴滴同样被禁过。利益面前还讲道理？反正我是不信的。腾讯的投资覆盖各个行业，一旦腾讯掌握了应用分发入口，给儿子们一些小小的甜头，应该不是什么大事儿吧。有人说AppStore也有很多限制，但至少苹果并没有像腾讯这样大量的投资消费级App，直接产生利益冲突的点并不多。话说回来，这点创业者是不用考虑的，暂时，你的产品和创意，在微信眼里还是个蝼蚁。。。你不用担心受到不公正的对待。如果真有一天你被微信封杀了，只要不是因为违规内容，那么你应该高兴，然后迅速炒作一波……",
        collection: 92,
        dateTime: "24小时前",
        headImgSrc: "/images/post/xiaolong.jpg",
        author: "猫是猫的猫",
        date: "Nov 20 2016",
        avatar: "/images/avatar/5.png",
        postId: 3,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100002mWVx72p8Ugp.m4a?fromtag=38",
            title: "恋恋风尘-老狼",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000",
        }
    },
    {
        title: "从视觉到触觉 这款VR手套能给你真实触感",
        content: "8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品",
        imgSrc: "/images/post/vr.png",
        reading: 102,
        detail: "VR进化论 8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。这些产品对于用户而言都是很好的选择，而Dexmo特别的地方就在于，其手部追踪增加了触觉反馈元素。该系统听上去或许像是科幻小说中的东西，但据Dexta称，其背后的理念在于，手部附着“在生理上会拉回你的手指来迎合虚拟物体的形状，会动态改变所施加的力量来模拟它们的坚硬度。”在确定Dexmo系统的最终版本之前，Dexta做了超过20个原型。该公司透露，Dexmo能够“模拟按按钮或者拨开开关的感觉。它能够模拟旋钮的形状，让你可以抓握和旋转。”虽然Dexmo颇具创新性，但它并非新产品。它其实早在2014年就在众筹平台Kickstarter上推出",
        collection: 26,
        dateTime: "24小时前",
        headImgSrc: "/images/post/vr.png",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "../../../images/avatar/3.png",
        postId: 4,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38",
            title: "沉默是金-张国荣",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
        }
    },
    {
        title: "爱奇艺创维开展战略合作，合力布局开放娱乐生态",
        content: "爱奇艺和创维分别作为国内领先的在线视频品牌",
        imgSrc: "/images/iqiyi.png",
        reading: 96,
        detail: "爱奇艺和创维分别作为国内领先的在线视频品牌和家电品牌。双方一直锐意创新，为用户提供优质的服务体验和产品体验。据悉，爱奇艺与创维将展开从资本到VIP会员服务等各方面的深入合作。籍由此次合作，爱奇艺将战略投资创维旗下拥有高端互联网电视品牌的酷开公司。从下一财年开始，创维旗下互联网电视将通过银河互联网电视集成播控平台，预置VIP会员服务及相关内容。这种捆绑终端与VIP内容的全新销售模式，将大幅提升互联网电视终端用户的体验，给予用户更多优质内容的选择。",
        collection: 26,
        dateTime: "21小时前",
        headImgSrc: "/images/iqiyi.png",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "../../../images/avatar/5.png",
        postId: 5,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38",
            title: "朋友-谭咏麟",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
        }
    },
]

module.exports = {
    postList: local_database
}